<script setup>

</script>
<template>
  <div class="adress">
    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path
        d="M12.9173 9.16667C12.9173 9.54969 12.8419 9.92896 12.6953 10.2828C12.5487 10.6367 12.3339 10.9582 12.063 11.2291C11.7922 11.4999 11.4707 11.7147 11.1168 11.8613C10.7629 12.0079 10.3837 12.0833 10.0007 12.0833C9.61763 12.0833 9.23836 12.0079 8.88449 11.8613C8.53063 11.7147 8.20909 11.4999 7.93826 11.2291C7.66742 10.9582 7.45258 10.6367 7.306 10.2828C7.15943 9.92896 7.08398 9.54969 7.08398 9.16667C7.08398 8.39312 7.39128 7.65125 7.93826 7.10427C8.48524 6.55729 9.2271 6.25 10.0007 6.25C10.7742 6.25 11.5161 6.55729 12.063 7.10427C12.61 7.65125 12.9173 8.39312 12.9173 9.16667Z"
        stroke="#232323" stroke-width="1.25" stroke-linecap="round" stroke-linejoin="round" />
      <path
        d="M10.001 1.6665C14.0593 1.6665 17.501 5.02734 17.501 9.10484C17.501 13.2465 14.0035 16.154 10.7735 18.1298C10.5376 18.2626 10.2716 18.3323 10.001 18.3323C9.73036 18.3323 9.46431 18.2626 9.22848 18.1298C6.00348 16.1357 2.50098 13.2623 2.50098 9.10567C2.50098 5.02734 5.94264 1.6665 10.001 1.6665Z"
        stroke="#232323" stroke-width="1.25" stroke-linecap="round" stroke-linejoin="round" />
    </svg>
    <p>
      ул. Красная, 123
      <span>Пункт выдачи</span>
    </p>
  </div>
</template>
<style lang="sass" scoped>
.adress 
  background: #fff
  display: flex
  align-items: center
  gap: 12px
  padding: 16px
  border-radius: 0 0 12px 12px 

  p 
    font-size: 14px
    line-height: 14px
    font-weight: 500
    span 
      font-size: 12px
      line-height: 12px
      color: #999 
</style>